src/data_analysis/collected_data/mango/api/standarda2v2/f/load_compose.txt
Running 60m test @ http://51.140.51.13:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 4428.476ms, rate sampling interval: 14557ms
  Thread calibration: mean lat.: 4423.184ms, rate sampling interval: 14704ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.57m    12.87m   45.16m    63.29%
    Req/Sec    97.90     67.88   381.00     90.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.14m 
 75.000%   29.20m 
 90.000%   37.29m 
 99.000%   45.16m 
 99.900%   48.27m 
 99.990%   50.47m 
 99.999%   52.18m 
100.000%   52.60m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     125.311     0.000000            1         1.00
  133169.151     0.100000        70623         1.11
  447217.663     0.200000       141239         1.25
  520617.983     0.300000       212012         1.43
  691011.583     0.400000       282462         1.67
  968359.935     0.500000       353155         2.00
 1151336.447     0.550000       388550         2.22
 1323302.911     0.600000       423724         2.50
 1479540.735     0.650000       459195         2.86
 1617952.767     0.700000       494440         3.33
 1752170.495     0.750000       529839         4.00
 1821376.511     0.775000       547550         4.44
 1891631.103     0.800000       565014         5.00
 1967128.575     0.825000       582631         5.71
 2048917.503     0.850000       600233         6.67
 2141192.191     0.875000       618080         8.00
 2189426.687     0.887500       627034         8.89
 2237661.183     0.900000       635748        10.00
 2290089.983     0.912500       644474        11.43
 2346713.087     0.925000       653475        13.33
 2403336.191     0.937500       662052        16.00
 2434793.471     0.943750       666640        17.78
 2466250.751     0.950000       671116        20.00
 2495610.879     0.956250       675262        22.86
 2527068.159     0.962500       679733        26.67
 2558525.439     0.968750       684127        32.00
 2575302.655     0.971875       686338        35.56
 2594177.023     0.975000       688703        40.00
 2613051.391     0.978125       690891        45.71
 2631925.759     0.981250       692956        53.33
 2654994.431     0.984375       695202        64.00
 2667577.343     0.985938       696263        71.11
 2682257.407     0.987500       697359        80.00
 2699034.623     0.989062       698534        91.43
 2715811.839     0.990625       699559       106.67
 2734686.207     0.992188       700641       128.00
 2745171.967     0.992969       701198       142.22
 2757754.879     0.993750       701763       160.00
 2772434.943     0.994531       702357       182.86
 2787115.007     0.995313       702893       213.33
 2801795.071     0.996094       703423       256.00
 2810183.679     0.996484       703686       284.44
 2820669.439     0.996875       703999       320.00
 2829058.047     0.997266       704226       365.71
 2841640.959     0.997656       704538       426.67
 2852126.719     0.998047       704781       512.00
 2860515.327     0.998242       704938       568.89
 2868903.935     0.998437       705082       640.00
 2877292.543     0.998633       705197       731.43
 2885681.151     0.998828       705325       853.33
 2896166.911     0.999023       705469      1024.00
 2902458.367     0.999121       705545      1137.78
 2908749.823     0.999219       705609      1280.00
 2915041.279     0.999316       705683      1462.86
 2921332.735     0.999414       705742      1706.67
 2929721.343     0.999512       705812      2048.00
 2933915.647     0.999561       705841      2275.56
 2940207.103     0.999609       705880      2560.00
 2946498.559     0.999658       705915      2925.71
 2954887.167     0.999707       705957      3413.33
 2963275.775     0.999756       705983      4096.00
 2969567.231     0.999780       705997      4551.11
 2980052.991     0.999805       706016      5120.00
 2990538.751     0.999829       706032      5851.43
 3001024.511     0.999854       706048      6826.67
 3011510.271     0.999878       706065      8192.00
 3021996.031     0.999890       706076      9102.22
 3034578.943     0.999902       706083     10240.00
 3042967.551     0.999915       706092     11702.86
 3055550.463     0.999927       706100     13653.33
 3072327.679     0.999939       706108     16384.00
 3080716.287     0.999945       706116     18204.44
 3084910.591     0.999951       706117     20480.00
 3089104.895     0.999957       706122     23405.71
 3099590.655     0.999963       706126     27306.67
 3103784.959     0.999969       706130     32768.00
 3110076.415     0.999973       706135     36408.89
 3110076.415     0.999976       706135     40960.00
 3114270.719     0.999979       706137     46811.43
 3120562.175     0.999982       706139     54613.33
 3126853.631     0.999985       706141     65536.00
 3128950.783     0.999986       706143     72817.78
 3128950.783     0.999988       706143     81920.00
 3131047.935     0.999989       706144     93622.86
 3133145.087     0.999991       706145    109226.67
 3135242.239     0.999992       706146    131072.00
 3137339.391     0.999993       706147    145635.56
 3137339.391     0.999994       706147    163840.00
 3143630.847     0.999995       706148    187245.71
 3143630.847     0.999995       706148    218453.33
 3145727.999     0.999996       706149    262144.00
 3145727.999     0.999997       706149    291271.11
 3145727.999     0.999997       706149    327680.00
 3154116.607     0.999997       706150    374491.43
 3154116.607     0.999998       706150    436906.67
 3154116.607     0.999998       706150    524288.00
 3154116.607     0.999998       706150    582542.22
 3154116.607     0.999998       706150    655360.00
 3156213.759     0.999999       706151    748982.86
 3156213.759     1.000000       706151          inf
#[Mean    =  1114132.714, StdDeviation   =   772205.185]
#[Max     =  3154116.608, Total count    =       706151]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  707308 requests in 60.00m, 160.66MB read
  Socket errors: connect 0, read 10138, write 79086, timeout 1554861
  Non-2xx or 3xx responses: 200325
Requests/sec:    196.47
Transfer/sec:     45.70KB